### pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name" : ["saad","Hassan","Jamal","zain","Abdullah","saeed","shahbaz","khurram"],
    "Marks" : [ '101','103','110','105','100','99','123','145'],
    "City" : ['Lahore','Lahore','Lahore','Lahore','Lahore','Lahore','shadra','shadra']
}

In [3]:
x = pd.DataFrame(dict1)

In [4]:
x

       Name Marks    City
0      saad   101  Lahore
1    Hassan   103  Lahore
2     Jamal   110  Lahore
3      zain   105  Lahore
4  Abdullah   100  Lahore
5     saeed    99  Lahore
6   shahbaz   123  shadra
7   khurram   145  shadra

In [5]:
x.to_csv('Result')

In [6]:
x.to_csv('Result_zeroIndex',index=False)

In [7]:
y = pd.read_csv('Result_zeroIndex')

In [8]:
y

       Name  Marks    City
0      saad    101  Lahore
1    Hassan    103  Lahore
2     Jamal    110  Lahore
3      zain    105  Lahore
4  Abdullah    100  Lahore
5     saeed     99  Lahore
6   shahbaz    123  shadra
7   khurram    145  shadra

In [9]:
y.head(2)

     Name  Marks    City
0    saad    101  Lahore
1  Hassan    103  Lahore

In [10]:
y.tail(2)

      Name  Marks    City
6  shahbaz    123  shadra
7  khurram    145  shadra

In [11]:
y.describe()

            Marks
count    8.000000
mean   110.750000
std     15.881256
min     99.000000
25%    100.750000
50%    104.000000
75%    113.250000
max    145.000000

In [12]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Marks   8 non-null      int64
 2   City    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [13]:
y["City"][2] = 'Begum Kot'

C:\Users\Dazzlingpc\AppData\Local\Temp\ipykernel_6968\3766930342.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  y["City"][2] = 'Begum Kot'
C:\Users\Dazzlingpc\AppData\Local\Temp\ipykernel_6968\3766930342.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  y["City"][2] = 'Begum Kot'

In [14]:
y

       Name  Marks       City
0      saad    101     Lahore
1    Hassan    103     Lahore
2     Jamal    110  Begum Kot
3      zain    105     Lahore
4  Abdullah    100     Lahore
5     saeed     99     Lahore
6   shahbaz    123     shadra
7   khurram    145     shadra

In [15]:
y.index = ['A','b','c','d','e','f','g','h']

In [16]:
y

       Name  Marks       City
A      saad    101     Lahore
b    Hassan    103     Lahore
c     Jamal    110  Begum Kot
d      zain    105     Lahore
e  Abdullah    100     Lahore
f     saeed     99     Lahore
g   shahbaz    123     shadra
h   khurram    145     shadra

In [17]:
series = pd.Series(np.random.rand(34))

In [18]:
type(series)

pandas.core.series.Series

In [19]:
newframe = pd.DataFrame(np.random.rand(100,7),index = np.arange(100))

In [20]:
newframe

           0         1         2         3         4         5         6
0   0.398845  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1   0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2   0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3   0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4   0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480
..       ...       ...       ...       ...       ...       ...       ...
95  0.845274  0.787119  0.591232  0.422662  0.561368  0.786855  0.748783
96  0.485683  0.628548  0.859104  0.092742  0.410844  0.735034  0.760133
97  0.991463  0.353882  0.348000  0.460392  0.334669  0.184085  0.380280
98  0.664630  0.929559  0.688656  0.846620  0.165984  0.138024  0.872569
99  0.237994  0.992492  0.707013  0.235978  0.806438  0.675082  0.160193

[100 rows x 7 columns]

In [21]:
type(newframe)

pandas.core.frame.DataFrame

In [22]:
newframe.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
6    float64
dtype: object

In [23]:
newframe.index

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53,
       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
       72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
       90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
      dtype='int64')

In [24]:
newframe.columns

RangeIndex(start=0, stop=7, step=1)

In [25]:
newframe.head()

          0         1         2         3         4         5         6
0  0.398845  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1  0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2  0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3  0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4  0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480

In [26]:
newframe.loc[0,0] = int(765)

In [27]:
newframe.head()

            0         1         2         3         4         5         6
0  765.000000  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1    0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2    0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3    0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4    0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480

In [28]:
type(newframe)

pandas.core.frame.DataFrame

In [29]:
newframe.columns = list("ABCDEFG")

In [30]:
newframe.head()

            A         B         C         D         E         F         G
0  765.000000  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1    0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2    0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3    0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4    0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480

In [31]:
newframe.loc[0,'A'] = 76993

In [32]:
newframe.head()

              A         B         C         D         E         F         G
0  76993.000000  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1      0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2      0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3      0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4      0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480

In [33]:
newframe.loc[0,0] = "RehmAn"

In [34]:
newframe.head(2)

,A,B,C,D,E,F,G,0
0,76993.000000,0.029218,0.340062,0.874785,0.880509,0.43700,0.667597,RehmAn
1,0.887657,0.643244,0.306668,0.682177,0.785699,0.32725,0.041624,NaN

In [35]:
newframe.head(2)

,A,B,C,D,E,F,G,0
0,76993.000000,0.029218,0.340062,0.874785,0.880509,0.43700,0.667597,RehmAn
1,0.887657,0.643244,0.306668,0.682177,0.785699,0.32725,0.041624,NaN

In [36]:
newframe = newframe.drop(0,axis=1)

In [37]:
newframe.head(1)

         A         B         C         D         E      F         G
0  76993.0  0.029218  0.340062  0.874785  0.880509  0.437  0.667597

In [38]:
nd = newframe.copy()

In [39]:
nd.head(2)

              A         B         C         D         E        F         G
0  76993.000000  0.029218  0.340062  0.874785  0.880509  0.43700  0.667597
1      0.887657  0.643244  0.306668  0.682177  0.785699  0.32725  0.041624

In [40]:
nd.loc[[1,2],['B','C']]

          B         C
1  0.643244  0.306668
2  0.773419  0.020464

In [41]:
nd.loc[:,['B','C']].head()

          B         C
0  0.029218  0.340062
1  0.643244  0.306668
2  0.773419  0.020464
3  0.945343  0.216596
4  0.513920  0.910071

In [42]:
nd.loc[[1,2],:].head()

          A         B         C         D         E         F         G
1  0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2  0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336

In [43]:
nd.isnull

<bound method DataFrame.isnull of                A         B         C         D         E         F         G
0   76993.000000  0.029218  0.340062  0.874785  0.880509  0.437000  0.667597
1       0.887657  0.643244  0.306668  0.682177  0.785699  0.327250  0.041624
2       0.784881  0.773419  0.020464  0.974345  0.124105  0.591362  0.843336
3       0.519868  0.945343  0.216596  0.122833  0.104888  0.658219  0.712137
4       0.589457  0.513920  0.910071  0.383700  0.897863  0.752476  0.300480
..           ...       ...       ...       ...       ...       ...       ...
95      0.845274  0.787119  0.591232  0.422662  0.561368  0.786855  0.748783
96      0.485683  0.628548  0.859104  0.092742  0.410844  0.735034  0.760133
97      0.991463  0.353882  0.348000  0.460392  0.334669  0.184085  0.380280
98      0.664630  0.929559  0.688656  0.846620  0.165984  0.138024  0.872569
99      0.237994  0.992492  0.707013  0.235978  0.806438  0.675082  0.160193

[100 rows x 7 columns]>

In [44]:
nd.isnull().head(2)

       A      B      C      D      E      F      G
0  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False

In [45]:
data = pd.DataFrame(np.random.randint(0,3,size=(3,2)),index  = np.arange(3))

In [46]:
data

   0  1
0  0  2
1  2  1
2  0  2

In [47]:
data.describe()

              0         1
count  3.000000  3.000000
mean   0.666667  1.666667
std    1.154701  0.577350
min    0.000000  1.000000
25%    0.000000  1.500000
50%    0.000000  2.000000
75%    1.000000  2.000000
max    2.000000  2.000000

In [48]:
data.median()

0    0.0
1    2.0
dtype: float64

In [49]:
data.max()

0    2
1    2
dtype: int32

In [50]:
data["total"] = data[0] + data[1]

In [51]:
data

   0  1  total
0  0  2      2
1  2  1      3
2  0  2      2

In [52]:
data.loc[2,0] = 2

In [53]:
data

   0  1  total
0  0  2      2
1  2  1      3
2  2  2      2

In [54]:
data.duplicated

<bound method DataFrame.duplicated of    0  1  total
0  0  2      2
1  2  1      3
2  2  2      2>

In [55]:
data.dropna()

   0  1  total
0  0  2      2
1  2  1      3
2  2  2      2

In [56]:
data.loc[0,0 ] = "NaN"

C:\Users\Dazzlingpc\AppData\Local\Temp\ipykernel_6968\2663719635.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NaN' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  data.loc[0,0 ] = "NaN"

In [57]:
data

     0  1  total
0  NaN  2      2
1    2  1      3
2    2  2      2

In [58]:
data.loc[0,1] = "NaN"

C:\Users\Dazzlingpc\AppData\Local\Temp\ipykernel_6968\2178716190.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NaN' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  data.loc[0,1] = "NaN"

In [59]:
data

     0    1  total
0  NaN  NaN      2
1    2    1      3
2    2    2      2

In [60]:
data = data.drop("total",axis = 1)

In [61]:
data

     0    1
0  NaN  NaN
1    2    1
2    2    2

In [62]:
data.dropna()

     0    1
0  NaN  NaN
1    2    1
2    2    2

In [63]:
data.duplicated

<bound method DataFrame.duplicated of      0    1
0  NaN  NaN
1    2    1
2    2    2>

In [64]:
# traning jb zada ho gi to model overfit
# traning jb kam ho gi to model underfit
# label data are suparise
# un lalel data are unsuparise
# reinforcement learning:experience kr ky seekhna
# ffill is use for fill next data number in back 
# bfill is use for fill last data number in back

In [65]:
data1 = pd.read_csv("emplyee.csv")

In [66]:
data1

   Unnamed: 0  EmployeeID     Name Department    Salary   Bonus
0           0           1    Alice         HR       NaN     NaN
1           1           2      Bob         IT       NaN     NaN
2           2           3  Charlie    Finance   70000.0  5000.0
3           3           4    David  Marketing   80000.0  6000.0
4           4           5      NaN        NaN   90000.0  7000.0
5           5           6      NaN        NaN  100000.0  8000.0

In [67]:
data1.dropna()

   Unnamed: 0  EmployeeID     Name Department   Salary   Bonus
2           2           3  Charlie    Finance  70000.0  5000.0
3           3           4    David  Marketing  80000.0  6000.0

In [68]:
data1["Salary"].duplicated().sum()

np.int64(1)

In [69]:
data1.drop_duplicates()

   Unnamed: 0  EmployeeID     Name Department    Salary   Bonus
0           0           1    Alice         HR       NaN     NaN
1           1           2      Bob         IT       NaN     NaN
2           2           3  Charlie    Finance   70000.0  5000.0
3           3           4    David  Marketing   80000.0  6000.0
4           4           5      NaN        NaN   90000.0  7000.0
5           5           6      NaN        NaN  100000.0  8000.0

In [70]:
data1["Salary"] = data1['Salary'].fillna(method="bfill")

C:\Users\Dazzlingpc\AppData\Local\Temp\ipykernel_6968\1731377714.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1["Salary"] = data1['Salary'].fillna(method="bfill")

In [71]:
data1

   Unnamed: 0  EmployeeID     Name Department    Salary   Bonus
0           0           1    Alice         HR   70000.0     NaN
1           1           2      Bob         IT   70000.0     NaN
2           2           3  Charlie    Finance   70000.0  5000.0
3           3           4    David  Marketing   80000.0  6000.0
4           4           5      NaN        NaN   90000.0  7000.0
5           5           6      NaN        NaN  100000.0  8000.0

In [72]:
data1["Bonus"] = data1['Bonus'].replace(np.nan,9000)

In [73]:
data1

   Unnamed: 0  EmployeeID     Name Department    Salary   Bonus
0           0           1    Alice         HR   70000.0  9000.0
1           1           2      Bob         IT   70000.0  9000.0
2           2           3  Charlie    Finance   70000.0  5000.0
3           3           4    David  Marketing   80000.0  6000.0
4           4           5      NaN        NaN   90000.0  7000.0
5           5           6      NaN        NaN  100000.0  8000.0

In [74]:
 data1 = data1.drop_duplicates(subset=['EmployeeID'])

In [75]:
data1

   Unnamed: 0  EmployeeID     Name Department    Salary   Bonus
0           0           1    Alice         HR   70000.0  9000.0
1           1           2      Bob         IT   70000.0  9000.0
2           2           3  Charlie    Finance   70000.0  5000.0
3           3           4    David  Marketing   80000.0  6000.0
4           4           5      NaN        NaN   90000.0  7000.0
5           5           6      NaN        NaN  100000.0  8000.0